{
  "header": [
    {
      "id": 0,
      "name": "Startseite",
      "url": "Startseite"
    },
    {
      "id": 1,
      "name": "Über mich",
      "url": "Uber-mich"
    },
    {
      "id": 2,
      "name": "Dienstleistungen",
      "url": "Dienstleistungen"
    },
    {
      "id": 3,
      "name": "Meine Fähigkeiten",
      "url": "Meine-Fahigkeiten"
    },
    {
      "id": 4,
      "name": "Meine Arbeit",
      "url": "Meine-Arbeit"
    },
    {
      "id": 5,
      "name": "Kontakt",
      "url": "Kontakt"
    }
  ],
  "firstSection": {
    "title": "Hallo, mein Name ist ",
    "name": "BEN FREDJ Mohamed Achraf",
    "description": "Ich bin Backend & Frontend Entwickler",
    "cv": "CV herunterladen"
  },
  "secondSection": {
    "title": "Über mich",
    "description": "Ich habe kürzlich erfolgreich ein dreijähriges Studium in angewandter Informatik mit Schwerpunkt Softwaretechnik am Institut für Informatik und Mathematik in Monastir (ISIMM) abgeschlossen. Für weitere Informationen über diese Institution lade ich Sie ein, ihre Website zu besuchen. Nach Abschluss dieses Abschnitts erhielt ich den Titel Computer-Techniker und stärkte damit meine praktischen Fähigkeiten erheblich. Derzeit bin ich im dritten Jahr des Informatikingenieurwesen-Programms an der TEK-UP University eingeschrieben (TEK-UP), wo ich mich auf die Entwicklung von Mobile, Web und Multimedia DMWM spezialisiere. Getrieben von einem ständigen Streben nach Exzellenz, suche ich aktiv nach einer Gelegenheit für mein Abschlussprojekt PFE. Meine berufliche Erfahrung hat sich durch mehrere Praktika während meines Grundstudiums und zwei Praktika während meines Ingenieurstudiums erweitert. Als aktives Mitglied des Webentwicklungsteams von Zeta Engineering seit den letzten sechs Monaten engagiere ich mich vollständig in konkreten und stimulierenden Projekten. Mein Portfolio, das nach diesem Text verfügbar ist, zeigt die Vielfalt und Qualität der von mir durchgeführten Projekte. Für eine vertiefte Erkundung meiner Arbeit ermutige ich Sie auch, mein GitHub (ach02raf) zu besuchen. Dort finden Sie meine Leistungen, insbesondere in den Technologien der JS/TS-Familie. Mein Engagement für technische Exzellenz und meine Fähigkeit, kreativ Probleme zu lösen, motivieren mich dazu, kontinuierlich neue Höhen im Bereich der Softwareentwicklung zu erreichen."
  },
  "slider": {
    "salutation": "Hello",
    "nom": "i'm Safa Chaabane",
    "work": ["Freelance", "web developer", "full stack developer"]
  }
}
