{
  "header": [
    {
      "id": 0,
      "name": "Startseite",
      "url": "Startseite"
    },
    {
      "id": 1,
      "name": "Über mich",
      "url": "Uber-mich"
    },
    {
      "id": 2,
      "name": "Dienstleistungen",
      "url": "Dienstleistungen"
    },
    {
      "id": 3,
      "name": "Meine Fähigkeiten",
      "url": "Meine-Fahigkeiten"
    },
    {
      "id": 4,
      "name": "Meine Arbeit",
      "url": "Meine-Arbeit"
    },
    {
      "id": 5,
      "name": "Kontakt",
      "url": "Kontakt"
    }
  ],
  "firstSection": {
    "title": "Hallo, mein Name ist ",
    "name": "BEN FREDJ Mohamed Achraf",
    "description": ["Ich bin ein Informatikingenieur"],
    "cv": "CV herunterladen"
  },
  "secondSection": {
    "title": ["Über", "mich"],
    "description": [
      "Ich habe kürzlich erfolgreich ein dreijähriges Studium in angewandter Informatik mit Schwerpunkt Softwaretechnik am Institut für Informatik und Mathematik in Monastir",
      "(ISIMM)",
      "abgeschlossen. Für weitere Informationen über diese Institution lade ich Sie ein, ihre Website zu besuchen. Nach Abschluss dieses Abschnitts erhielt ich den Titel Computer-Techniker und stärkte damit meine praktischen Fähigkeiten erheblich. Derzeit bin ich im dritten Jahr des Informatikingenieurwesen-Programms an der TEK-UP University eingeschrieben (",
      "TEK-UP",
      "), wo ich mich auf die Entwicklung von Mobile, Web und Multimedia DMWM spezialisiere. Getrieben von einem ständigen Streben nach Exzellenz, suche ich aktiv nach einer Gelegenheit für mein Abschlussprojekt PFE. Meine berufliche Erfahrung hat sich durch mehrere Praktika während meines Grundstudiums und zwei Praktika während meines Ingenieurstudiums erweitert. Als aktives Mitglied des Webentwicklungsteams von Zeta Engineering seit den letzten sechs Monaten engagiere ich mich vollständig in konkreten und stimulierenden Projekten. Mein Portfolio, das nach diesem Text verfügbar ist, zeigt die Vielfalt und Qualität der von mir durchgeführten Projekte. Für eine vertiefte Erkundung meiner Arbeit ermutige ich Sie auch, mein GitHub (",
      "ach02raf",
      ") zu besuchen. Dort finden Sie meine Leistungen, insbesondere in den Technologien der JS/TS-Familie. Mein Engagement für technische Exzellenz und meine Fähigkeit, kreativ Probleme zu lösen, motivieren mich dazu, kontinuierlich neue Höhen im Bereich der Softwareentwicklung zu erreichen."
    ]
  },
  "slider": {
    "salutation": "Hello",
    "nom": "i'm Safa Chaabane",
    "work": ["Freelance", "web developer", "full stack developer"]
  },
  "ServicesSection": {
    "title": ["Meine", "Dienstleistungen"],
    "description": "LASSEN SIE UNS EINEN BLICK AUF MEINE DIENSTLEISTUNGEN WERFEN",
    "listServices": [
      {
        "id": 1,
        "title": "Webintegration",
        "desc": "Entwicklung und Integration eines grafischen Entwurfs, um ihn in ein konformes Webprojekt zu verwandeln. Ich lege besonderen Wert auf die Benutzererfahrung und die Optimierung (SEO & Anzeigegeschwindigkeit) in all meinen Projekten.",
        "img": "faMagic"
      },
      {
        "id": 2,
        "title": "E-Commerce",
        "desc": "Erstellung einer E-Commerce-Plattform mit dem E-Commerce-CMS Magento, einer der umfassendsten Open-Source-Lösungen. Ich habe mich auf spezifische Entwicklungen spezialisiert, um Magento an Ihre Bedürfnisse und Abläufe anzupassen.",
        "img": "faShoppingBag"
      },
      {
        "id": 3,
        "title": "Web- und mobile Anwendungen",
        "desc": "Erstellung von Unternehmensanwendungen, Intranet, Extranet, Corporate- und Showcase-Websites, Web-Apps usw. Regelmäßige Updates, Fehlerbehebungen, Leistungsoptimierung und Verbesserungen der Sicherheit von Anwendungen und Websites.",
        "img": "faGears"
      },
      {
        "id": 4,
        "title": "Codeüberprüfung",
        "desc": "Analyse und Sicherstellung, dass der Code bewährten Praktiken entspricht, und Sicherstellung seiner Qualität (Lesbarkeit, Klarheit, Konsistenz). Dadurch wird der Code wartungsfreundlicher, besser strukturiert und die Anzahl der Fehler wird reduziert.",
        "img": "faCode"
      },
      {
        "id": 5,
        "title": "Optimierung",
        "desc": "Durchführung einer Leistungsanalyse und Optimierung Ihrer Anwendungen durch eingehende Untersuchung des Quellcodes, der Interaktionen zwischen verschiedenen Komponenten und Datenbanken, um wirksame Maßnahmen zur Verbesserung der Anwendungsleistung zu ergreifen.",
        "img": "faRocket"
      },
      {
        "id": 6,
        "title": "SEO",
        "desc": "Optimierung für Suchmaschinen durch Anwendung einer Reihe von Techniken, Regeln und bewährten Methoden zur Verbesserung der Sichtbarkeit von Websites und ihrer Positionen in den Suchergebnissen.",
        "img": "faBullhorn"
      }
    ]
  },
  "contactSection": {
    "title": "Kontaktiere Mich",
    "location": "Tunis, Tunesien",
    "email": "ach02raf@gmail.com",
    "phoneNumber": "+216 94622592"
  },
  "skillsSection": {
    "title": "Meine Fähigkeiten",
    "listeSkills": [
      {
        "id": 0,
        "title": "Programmiersprachen",
        "listeLangage": [
          "C",
          "C-SHARP",
          "JAVA",
          "JAVASCRIPT",
          "TYPESCRIPT",
          "PYTHON",
          "PHP"
        ]
      },
      {
        "id": 1,
        "title": "Frameworks",
        "listeLangage": [
          "EXPRESS.JS",
          "NEXT.JS",
          "SPRINGBOOT",
          "DJANGO",
          "ANGULAR",
          "REACT-NATIVE",
          "SWIFT-UI",
          "IONIC",
          "DOTNET-CORE",
          "BOOTSTRAP-5",
          "TAILWIND-CSS"
        ]
      },
      {
        "id": 2,
        "title": "Auszeichnungssprachen",
        "listeLangage": ["HTML"]
      },
      {
        "id": 3,
        "title": "Stilsprachen",
        "listeLangage": ["CSS", "SCSS-SASS"]
      },
      {
        "id": 4,
        "title": "JS/TS Bibliotheken",
        "listeLangage": ["REACT"]
      },
      {
        "id": 5,
        "title": "DevOps",
        "listeLangage": ["GIT", "GITHUB", "JENKINS", "HOSTINGER", "AWS"]
      },
      {
        "id": 6,
        "title": "CMS",
        "listeLangage": ["WORDPRESS"]
      },
      {
        "id": 7,
        "title": "Andere",
        "listeLangage": ["REST-RESTFUL", "GRAPHQL"]
      }
    ]
  },
  "EducationExperience": [
    {
      "title": "Erfahrung",
      "list": [
        {
          "title": "ZETA Engineering",
          "subtitle": "Webentwickler",
          "desc": [
            "Erstellung eines Pakets mit 16 Websites mit dem WordPress-CMS",
            "Entwicklung eines Pakets mit 4 Websites mit dem Next.js-Framework",
            "Optimierung des SEO für die in beiden Paketen enthaltenen Websites"
          ],
          "dateDeb": "August 2023",
          "dateFin": "Gegenwart"
        },
        {
          "title": "ZETA Engineering",
          "subtitle": "Sommerpraktikum 2023",
          "desc": ["Schulung zum WordPress-CMS und SEO"],
          "dateDeb": "Juni 2023",
          "dateFin": "Juli 2023"
        },
        {
          "title": "SHAREK IT",
          "subtitle": "Sommerpraktikum 2022",
          "desc": [
            "Erstellung einer E-Commerce-Website zum Verkauf von Computergeräten INFO-LINA",
            "MERN STACK, BOOTSTRAP"
          ],
          "dateDeb": "Juni 2022",
          "dateFin": "August 2022"
        },
        {
          "title": "COSO-FT IT",
          "subtitle": "Praktikum im Abschlussjahr 2020",
          "desc": [
            "Erstellung der Web- und mobilen Anwendung für die Terminvereinbarung in der Medizin: ALLO DOCTOR",
            "MERN STACK, REACT-NATIVE"
          ],
          "dateDeb": "Januar 2020",
          "dateFin": "Juli 2020"
        },
        {
          "title": "SARTEX GROUP",
          "subtitle": "Sommerpraktikum 2018",
          "desc": ["IT-Wartung", "Cloud Computing"],
          "dateDeb": "Juni 2018",
          "dateFin": "Juli 2018"
        }
      ]
    },
    {
      "title": "Bildung",
      "list": [
        {
          "title": "TEK-UP Universität",
          "subtitle": "Informatikingenieurwesen",
          "desc": [
            "Spezialisierung in der Entwicklung von Web-, Mobile- und Multimedia-Anwendungen"
          ],
          "dateDeb": "2021",
          "dateFin": "Gegenwart"
        },
        {
          "title": "ISIMM | Höheres Institut für Informatik und Mathematik, Monastir",
          "subtitle": "Bachelor-Abschluss in Informatik",
          "desc": ["Spezialisierung in Softwaretechnik"],
          "dateDeb": "2016",
          "dateFin": "2020"
        },
        {
          "title": "LKM | Gymnasium Ksibet El Mediouni",
          "subtitle": "Technisches Abitur",
          "desc": [],
          "dateDeb": "2015",
          "dateFin": "2016"
        }
      ]
    }
  ],
  "Project": {
    "title": ["Mes Dernieres", " projets"],
    "list": [
      {
        "id": "0",
        "nameProject": "ALLO DOCTOR",
        "infoProject": "INFOS PROJET",
        "visitSites": "Visiter le site",
        "codeSource": "Voir le code source",
        "downloadAPK": "Télécharcher l'APK",
        "title": "Creating a mobile application for scheduling medical appointments online",
        "descProject": "ALLO DOCTOR, an innovative solution, offers the possibility to book medical appointments online through a sophisticated mobile application developed with advanced React Native technology. The robustness of our infrastructure relies on a backend developed with Express.js, supported by the power of MongoDB as a database. This approach ensures a smooth user experience, efficient data management, and a quick response to requests, thereby elevating the level of quality and professionalism of our online medical reservation service.",
        "imgProject": "ALLO-DOCTOR",
        "videoProject": "ALLO-DOCTOR",
        "urlProject": [
          "https://github.com/ach02raf/ach02raf-ALLO-DOCTOR-APP-Front",
          "https://github.com/ach02raf/ach02raf-ALLO-DOCTOR-APP-back"
        ],
        "urlSITE": [""],
        "apk": "",
        "usedTools": "Les outils utilisés",
        "tools": ["REACT NATIVE", "EXPRESS.JS", "MONGO.DB"]
      },

      {
        "id": "1",
        "nameProject": "API SOAP",
        "infoProject": "INFOS PROJET",
        "visitSites": "Visiter le site",
        "codeSource": "Voir le code source",
        "downloadAPK": "Télécharcher l'APK",
        "title": "Creating a SOAP API using Spring Boot projects",
        "descProject": "Creating a SOAP API with Spring Boot provides a powerful and efficient approach to web application development. Using this robust platform, we can design a modern and scalable SOAP API, facilitating communication between different systems. Spring Boot simplifies the process by providing default configuration and built-in features, enabling rapid implementation and optimal management of web services. This approach, combining the flexibility of Spring Boot and SOAP communication standards, ensures seamless and secure integration, meeting the most demanding API development needs.",
        "imgProject": "",
        "videoProject": "",
        "urlProject": [
          "https://github.com/ach02raf/Project-SOAP-SPRING-BOOT",
          "https://github.com/ach02raf/Project-SOAP-SPRING-BOOT-2",
          "https://github.com/ach02raf/Project-SOAP-SPRING-BOOT-3"
        ],
        "urlSITE": [""],
        "apk": "",
        "usedTools": "Les outils utilisés",
        "tools": ["SPRING BOOT", "POSTMAN"]
      },
      {
        "id": "2",
        "nameProject": "GoTRIP",
        "infoProject": "INFOS PROJET",
        "visitSites": "Visiter le site",
        "codeSource": "Voir le code source",
        "downloadAPK": "Télécharcher l'APK",
        "title": "Creating a mobile application to organize and book travel and hiking with an online guide",
        "descProject": "An innovative mobile application that allows users to select tourist routes offered by expert guides. In addition to allowing tourists to choose their favorite destinations and create personalized itineraries, the application consists of two parts: a dynamic user interface developed with the Ionic framework for the front-end, and a robust server-side infrastructure created with Express.js and MongoDB for the back-end. It also offers the functionality to choose from a list of available guides, view their profiles, and read reviews left by other tourists.",
        "imgProject": "",
        "videoProject": "",
        "urlProject": [
          "https://github.com/ach02raf/GoTrip-ionic-application",
          "https://github.com/ach02raf/GoTrip-ionic-application-backend"
        ],
        "urlSITE": [""],
        "apk": "gotrip",
        "usedTools": "Les outils utilisés",
        "tools": ["IONIC framework", "EXPRESS.JS", "MONGO.DB", "POSTMAN"]
      },
      {
        "id": "3",
        "nameProject": "ARTVERSE",
        "infoProject": "INFOS PROJET",
        "visitSites": "Visiter le site",
        "codeSource": "Voir le code source",
        "downloadAPK": "Télécharcher l'APK",
        "title": "Creating a responsive web application for digital art: ARTIVESE",
        "descProject": "With the rise of the Internet and social media, various online platforms have emerged, simplifying communication, information sharing, and collaboration. These spaces have opened new perspectives in artistic creation and cultural promotion, integrating the artistic domain into digital transformation. Nowadays, more and more artists are turning to digital art, including digital painting, 3D sculpture, electronic music, and virtual reality. This transition has led to the emergence of online platforms dedicated to showcasing digital art. These spaces offer artists the opportunity to present their creations to a wider audience, allowing art enthusiasts to discover unique and innovative works. Digital art platforms take various forms, from virtual galleries to digital artwork sales sites, to social networks specializing in art. Our project fits into this context, aiming to establish a dedicated digital art platform, providing artists with a specific space to showcase their talent. In this report, we will detail the various stages of the realization of our project.",
        "imgProject": "",
        "videoProject": "",
        "urlProject": [
          "https://github.com/ach02raf/ARTVERSE-PROJECT",
          "https://github.com/ach02raf/ARTVERSE-PROJECT-API-NODEJS",
          "https://github.com/ach02raf/ARTVERSE-PROJECT-API-DJANGO"
        ],
        "urlSITE": ["https://ach02raf.github.io/ARTVERSE-PROJECT/"],
        "apk": "",
        "usedTools": "Les outils utilisés",
        "tools": ["ANGULAR & MEAN-STACK", "EXPRESS.JS", "MONGO.DB", "POSTMAN"]
      }
    ]
  },
  "citation": {
    "name": "Janet Williams",
    "citation": "L'informatique, c'est plus que des lignes de code. C'est l'expression de la créativité, la résolution de problèmes et la construction d'un avenir numérique."
  },
  "Footer": { "title": "@ 2023 ALLE RECHTE VORBEHALTEN VON ACH02RAF" }
}
