{
  "header": [
    {
      "id": 0,
      "name": "Home",
      "url": "Home"
    },
    {
      "id": 1,
      "name": "About me",
      "url": "About-me"
    },
    {
      "id": 2,
      "name": "Services",
      "url": "Services"
    },
    {
      "id": 3,
      "name": "My skills",
      "url": "My-skills"
    },
    {
      "id": 4,
      "name": "My work",
      "url": "My-work"
    },
    {
      "id": 5,
      "name": "Contact me",
      "url": "Contact-me"
    }
  ],
  "firstSection": {
    "title": "Hello , My Name is ",
    "name": "BEN FREDJ Mohamed Achraf",
    "description": [" I am a computer engineer"],
    "cv": "Download CV"
  },
  "secondSection": {
    "title": ["About", "me"],
    "description": [
      "I have recently successfully completed a three-year program in fundamental computer science, specializing in software engineering, at the Higher Institute of Computer Science and Mathematics of Monastir (",
      "ISIMM",
      "). Upon completing this stage, I earned the title of computer technician, significantly enhancing my practical skills. Currently enrolled in the third year of the computer engineering program at TEK-UP University (",
      "TEK-UP",
      "), I am specializing in Mobile, Web, and Multimedia Development DMWM. Driven by a constant pursuit of excellence, I am actively seeking an opportunity for my final year project PFE. My professional experience has grown through multiple internships during my undergraduate studies and two internships during my engineering program. As an active member of Zeta Engineering's web development team for the past six months, I am fully engaged in concrete and stimulating projects. My portfolio, available following this text, showcases the diversity and quality of the projects I have undertaken. For a more in-depth exploration of my work, I also encourage you to check out my GitHub (",
      "ach02raf",
      "). There, you will find my achievements, particularly in JS/TS family technologies. My commitment to technical excellence and my ability to creatively solve problems drive me to continually reach new heights in the field of software development."
    ]
  },
  "slider": {
    "salutation": "Hello",
    "nom": "i'm Safa Chaabane",
    "work": ["Freelance", "web developer", "full stack developer"]
  },
  "ServicesSection": {
    "title": ["My", "Services"],
    "description": "LET'S TAKE A QUICK LOOK AT MY SERVICES",
    "listServices": [
      {
        "id": 1,
        "title": "Web Integration",
        "desc": "Development and integration of a graphic design to convert it into a compliant web project. I pay special attention to user experience and optimization (SEO & display speed) across all my projects.",
        "img": "faMagic"
      },
      {
        "id": 2,
        "title": "Ecommerce",
        "desc": "Creation of an e-commerce platform using the Magento e-commerce CMS, which is one of the most comprehensive open-source solutions. I specialize in specific developments to adapt Magento to your needs and operations.",
        "img": "faShoppingBag"
      },
      {
        "id": 3,
        "title": "Web & Mobile Application",
        "desc": "Creation of business applications, Intranet, Extranet, Corporate and showcase sites, Web apps, etc. Regular updates, bug fixes, performance optimization, and improvements in the security of applications and websites.",
        "img": "faGears"
      },
      {
        "id": 4,
        "title": "Code Review",
        "desc": "Analyzing and ensuring that the code adheres to best practices, and ensuring its quality (readability, clarity, consistency). This makes the code more maintainable, better structured, and reduces the number of bugs.",
        "img": "faCode"
      },
      {
        "id": 5,
        "title": "Optimization",
        "desc": "Performing a performance analysis and optimization of your applications by delving into the source code, interactions between different components, and databases to take effective actions to improve application performance.",
        "img": "faRocket"
      },
      {
        "id": 6,
        "title": "SEO - Search Engine Optimization",
        "desc": "Optimizing for search engines by applying a set of techniques, rules, and best practices to improve the visibility of websites and their positions in search engine results.",
        "img": "faBullhorn"
      }
    ]
  },
  "contactSection": {
    "title": "Contact Me",
    "location": "Tunis, Tunisia",
    "email": "ach02raf@gmail.com",
    "phoneNumber": "+216 94622592"
  },
  "skillsSection": {
    "title": "My Skills",
    "listeSkills": [
      {
        "id": 0,
        "title": "Programming Languages",
        "listeLangage": [
          "C",
          "C-SHARP",
          "JAVA",
          "JAVASCRIPT",
          "TYPESCRIPT",
          "PYTHON",
          "PHP"
        ]
      },
      {
        "id": 1,
        "title": "Frameworks",
        "listeLangage": [
          "EXPRESS.JS",
          "NEXT.JS",
          "SPRINGBOOT",
          "DJANGO",
          "ANGULAR",
          "REACT-NATIVE",
          "SWIFT-UI",
          "IONIC",
          "DOTNET-CORE",
          "BOOTSTRAP-5",
          "TAILWIND-CSS"
        ]
      },
      {
        "id": 2,
        "title": "Markup Languages",
        "listeLangage": ["HTML"]
      },
      {
        "id": 3,
        "title": "Style Languages",
        "listeLangage": ["CSS", "SCSS-SASS"]
      },
      {
        "id": 4,
        "title": "JS/TS Libraries",
        "listeLangage": ["REACT"]
      },
      {
        "id": 5,
        "title": "DevOps",
        "listeLangage": ["GIT", "GITHUB", "JENKINS", "HOSTINGER", "AWS"]
      },
      {
        "id": 6,
        "title": "CMS",
        "listeLangage": ["WORDPRESS"]
      },
      {
        "id": 7,
        "title": "Others",
        "listeLangage": ["REST-RESTFUL", "GRAPHQL"]
      }
    ]
  },
  "EducationExperience": [
    {
      "title": "Experience",
      "list": [
        {
          "title": "ZETA Engineering",
          "subtitle": "Web Developer",
          "desc": [
            "Created a package of 16 websites with the WordPress CMS",
            "Developed a package of 4 sites with the Next.js framework",
            "Optimized SEO for the sites included in both packages"
          ],
          "dateDeb": "August 2023",
          "dateFin": "Present"
        },
        {
          "title": "ZETA Engineering",
          "subtitle": "Summer Internship 2023",
          "desc": ["Training on the WordPress CMS and SEO"],
          "dateDeb": "June 2023",
          "dateFin": "July 2023"
        },
        {
          "title": "SHAREK IT",
          "subtitle": "Summer Internship 2022",
          "desc": [
            "Created an e-commerce website for selling computer equipment INFO-LINA",
            "MERN STACK, BOOTSTRAP"
          ],
          "dateDeb": "June 2022",
          "dateFin": "August 2022"
        },
        {
          "title": "COSO-FT IT",
          "subtitle": "Final Year Internship 2020",
          "desc": [
            "Created the web and mobile application for medical appointment scheduling: ALLO DOCTOR",
            "MERN STACK, REACT-NATIVE"
          ],
          "dateDeb": "January 2020",
          "dateFin": "July 2020"
        },
        {
          "title": "SARTEX GROUP",
          "subtitle": "Summer Internship 2018",
          "desc": ["IT Maintenance", "Cloud Computing"],
          "dateDeb": "June 2018",
          "dateFin": "July 2018"
        }
      ]
    },
    {
      "title": "Education",
      "list": [
        {
          "title": "TEK-UP University",
          "subtitle": "Computer Engineering",
          "desc": ["Specialization in web, mobile, and multimedia development"],
          "dateDeb": "2021",
          "dateFin": "Present"
        },
        {
          "title": "ISIMM | Higher Institute of Computer Science and Mathematics, Monastir",
          "subtitle": "Bachelor's Degree in Computer Science",
          "desc": ["Specialization in software engineering"],
          "dateDeb": "2016",
          "dateFin": "2020"
        },
        {
          "title": "LKM | Ksibet El Mediouni High School",
          "subtitle": "Technical Baccalaureate",
          "desc": [],
          "dateDeb": "2015",
          "dateFin": "2016"
        }
      ]
    }
  ],

  "Project": {
    "title": ["Mes Dernieres", " projets"],
    "list": [
      {
        "id": "0",
        "nameProject": "ALLO DOCTOR",
        "infoProject": "INFOS PROJET",
        "visitSites": "Visiter le site",
        "codeSource": "Voir le code source",
        "downloadAPK": "Télécharcher l'APK",
        "title": "Creating a mobile application for scheduling medical appointments online",
        "descProject": "ALLO DOCTOR, an innovative solution, offers the possibility to book medical appointments online through a sophisticated mobile application developed with advanced React Native technology. The robustness of our infrastructure relies on a backend developed with Express.js, supported by the power of MongoDB as a database. This approach ensures a smooth user experience, efficient data management, and a quick response to requests, thereby elevating the level of quality and professionalism of our online medical reservation service.",
        "imgProject": "ALLO-DOCTOR",
        "videoProject": "ALLO-DOCTOR",
        "urlProject": [
          "https://github.com/ach02raf/ach02raf-ALLO-DOCTOR-APP-Front",
          "https://github.com/ach02raf/ach02raf-ALLO-DOCTOR-APP-back"
        ],
        "urlSITE": [""],
        "apk": "",
        "usedTools": "Les outils utilisés",
        "tools": ["REACT NATIVE", "EXPRESS.JS", "MONGO.DB"]
      },

      {
        "id": "1",
        "nameProject": "API SOAP",
        "infoProject": "INFOS PROJET",
        "visitSites": "Visiter le site",
        "codeSource": "Voir le code source",
        "downloadAPK": "Télécharcher l'APK",
        "title": "Creating a SOAP API using Spring Boot projects",
        "descProject": "Creating a SOAP API with Spring Boot provides a powerful and efficient approach to web application development. Using this robust platform, we can design a modern and scalable SOAP API, facilitating communication between different systems. Spring Boot simplifies the process by providing default configuration and built-in features, enabling rapid implementation and optimal management of web services. This approach, combining the flexibility of Spring Boot and SOAP communication standards, ensures seamless and secure integration, meeting the most demanding API development needs.",
        "imgProject": "",
        "videoProject": "",
        "urlProject": [
          "https://github.com/ach02raf/Project-SOAP-SPRING-BOOT",
          "https://github.com/ach02raf/Project-SOAP-SPRING-BOOT-2",
          "https://github.com/ach02raf/Project-SOAP-SPRING-BOOT-3"
        ],
        "urlSITE": [""],
        "apk": "",
        "usedTools": "Les outils utilisés",
        "tools": ["SPRING BOOT", "POSTMAN"]
      },
      {
        "id": "2",
        "nameProject": "GoTRIP",
        "infoProject": "INFOS PROJET",
        "visitSites": "Visiter le site",
        "codeSource": "Voir le code source",
        "downloadAPK": "Télécharcher l'APK",
        "title": "Creating a mobile application to organize and book travel and hiking with an online guide",
        "descProject": "An innovative mobile application that allows users to select tourist routes offered by expert guides. In addition to allowing tourists to choose their favorite destinations and create personalized itineraries, the application consists of two parts: a dynamic user interface developed with the Ionic framework for the front-end, and a robust server-side infrastructure created with Express.js and MongoDB for the back-end. It also offers the functionality to choose from a list of available guides, view their profiles, and read reviews left by other tourists.",
        "imgProject": "",
        "videoProject": "",
        "urlProject": [
          "https://github.com/ach02raf/GoTrip-ionic-application",
          "https://github.com/ach02raf/GoTrip-ionic-application-backend"
        ],
        "urlSITE": [""],
        "apk": "gotrip",
        "usedTools": "Les outils utilisés",
        "tools": ["IONIC framework", "EXPRESS.JS", "MONGO.DB", "POSTMAN"]
      },
      {
        "id": "3",
        "nameProject": "ARTVERSE",
        "infoProject": "INFOS PROJET",
        "visitSites": "Visiter le site",
        "codeSource": "Voir le code source",
        "downloadAPK": "Télécharcher l'APK",
        "title": "Creating a responsive web application for digital art: ARTIVESE",
        "descProject": "With the rise of the Internet and social media, various online platforms have emerged, simplifying communication, information sharing, and collaboration. These spaces have opened new perspectives in artistic creation and cultural promotion, integrating the artistic domain into digital transformation. Nowadays, more and more artists are turning to digital art, including digital painting, 3D sculpture, electronic music, and virtual reality. This transition has led to the emergence of online platforms dedicated to showcasing digital art. These spaces offer artists the opportunity to present their creations to a wider audience, allowing art enthusiasts to discover unique and innovative works. Digital art platforms take various forms, from virtual galleries to digital artwork sales sites, to social networks specializing in art. Our project fits into this context, aiming to establish a dedicated digital art platform, providing artists with a specific space to showcase their talent. In this report, we will detail the various stages of the realization of our project.",
        "imgProject": "",
        "videoProject": "",
        "urlProject": [
          "https://github.com/ach02raf/ARTVERSE-PROJECT",
          "https://github.com/ach02raf/ARTVERSE-PROJECT-API-NODEJS",
          "https://github.com/ach02raf/ARTVERSE-PROJECT-API-DJANGO"
        ],
        "urlSITE": ["https://ach02raf.github.io/ARTVERSE-PROJECT/"],
        "apk": "",
        "usedTools": "Les outils utilisés",
        "tools": ["ANGULAR & MEAN-STACK", "EXPRESS.JS", "MONGO.DB", "POSTMAN"]
      }
    ]
  },
  "citation": {
    "name": "Janet Williams",
    "citation": "L'informatique, c'est plus que des lignes de code. C'est l'expression de la créativité, la résolution de problèmes et la construction d'un avenir numérique."
  },
  "Footer": { "title": "@ 2023 ALL RIGHT RESERVED BY ACH02RAF " }
}
