{
  "header": [
    {
      "id": 0,
      "name": "Home",
      "url": "Home"
    },
    {
      "id": 1,
      "name": "About me",
      "url": "About-me"
    },
    {
      "id": 2,
      "name": "Services",
      "url": "Services"
    },
    {
      "id": 3,
      "name": "My skills",
      "url": "My-skills"
    },
    {
      "id": 4,
      "name": "My work",
      "url": "My-work"
    },
    {
      "id": 5,
      "name": "Contact me",
      "url": "Contact-me"
    }
  ],
  "firstSection": {
    "title": "Hello , My Name is ",
    "name": "BEN FREDJ Mohamed Achraf",
    "description": "I'am a Backend & Frontend developer",
    "cv": "Download CV"
  },
  "secondSection": {
    "title": ["About", "me"],
    "description": ["I have recently successfully completed a three-year program in fundamental computer science, specializing in software engineering, at the Higher Institute of Computer Science and Mathematics of Monastir (","ISIMM","). For more information about this institution, I invite you to visit its website. Upon completing this stage, I earned the title of computer technician, significantly enhancing my practical skills. Currently enrolled in the third year of the computer engineering program at TEK-UP University (","TEK-UP","), I am specializing in Mobile, Web, and Multimedia Development DMWM. Driven by a constant pursuit of excellence, I am actively seeking an opportunity for my final year project PFE. My professional experience has grown through multiple internships during my undergraduate studies and two internships during my engineering program. As an active member of Zeta Engineering's web development team for the past six months, I am fully engaged in concrete and stimulating projects. My portfolio, available following this text, showcases the diversity and quality of the projects I have undertaken. For a more in-depth exploration of my work, I also encourage you to check out my GitHub (","ach02raf","). There, you will find my achievements, particularly in JS/TS family technologies. My commitment to technical excellence and my ability to creatively solve problems drive me to continually reach new heights in the field of software development."]
  },
  "slider": {
    "salutation": "Hello",
    "nom": "i'm Safa Chaabane",
    "work": ["Freelance", "web developer", "full stack developer"]
  },
  "contactSection": {
    "title": "Contact Me",
    "location": "Tunis, Tunisia",
    "email": "ach02raf@gmail.com",
    "phoneNumber": "+216 94622592"
  },
  "Footer": { "title": "@ 2023 ALL RIGHT RESERVED BY ACH02RAF " }
}
