{
  "header": [
    {
      "id": 0,
      "name": "Accueil",
      "url": "Accueil"
    },
    {
      "id": 1,
      "name": "À propos",
      "url": "A-propos"
    },
    {
      "id": 2,
      "name": "Services",
      "url": "Services"
    },
    {
      "id": 3,
      "name": "Mes compétences",
      "url": "Mes-competences"
    },
    {
      "id": 4,
      "name": "Mon travail",
      "url": "Mon-travail"
    },
    {
      "id": 5,
      "name": "Contactez moi",
      "url": "Contactez-moi"
    }
  ],
  "firstSection": {
    "title": "Bonjour, Je m'appelle ",
    "name": "BEN FREDJ Mohamed Achraf",
    "description": "Je suis développeur Backend & Frontend",
    "cv": "Télécharger CV"
  },
  "secondSection": {
    "title": ["À propos", "de moi"],
    "description": [
      "Je viens de conclure avec succès un parcours de trois ans en licence fondamentale en informatique, spécialisée en génie logiciel, à l'Institut Supérieur d'Informatique et de Mathématiques de Monastir (",
      "ISIMM",
      "). Pour de plus amples informations sur cette institution. À l'issue de cette étape, j'ai obtenu le titre de technicien en informatique, renforçant ainsi mes compétences pratiques de manière significative. Actuellement inscrit en troisième année du cycle d'ingénierie en informatique à l'Université TEK-UP (",
      "TEK-UP",
      "), je me spécialise dans le Développement Mobile, Web et Multimédia (DMWM). Animé par une quête incessante d'excellence, je suis activement à la recherche d'une opportunité de stage de fin d'études PFE . Mon expérience professionnelle s'est enrichie au fil de multiples stages réalisés pendant ma licence, ainsi que de deux stages durant mon cycle d'ingénierie. En tant que membre actif de l'équipe de Zeta Engineering depuis les six derniers mois en tant que développeur web, je m'investis pleinement dans des projets concrets et stimulants. Mon portfolio, disponible à la suite de ce texte, illustre la diversité et la qualité des projets que j'ai réalisés. Pour une exploration plus approfondie de mon travail, je vous encourage également à consulter mon GitHub (",
      "ach02raf",
      "). Vous y découvrirez mes réalisations, notamment dans les technologies de la famille JS/TS. Mon dévouement envers l'excellence technique et ma capacité à résoudre créativement des problèmes me stimulent à atteindre continuellement de nouveaux sommets dans le domaine du développement informatique."
    ]
  },
  "slider": {
    "salutation": "Bonjour",
    "nom": "Je suis Safa Chaabane",
    "work": ["Freelance", "web developer", "full stack developer"]
  },
  "ServicesSection": {
    "title": "Mes services",
    "description": "FAISONS UN PEU LE TOUR DE MES SERVICES",
    "listServices": [
      {
        "id": 1,
        "title": "Intégration web",
        "desc": "Développement et intégration d'une maquette graphique pour la convertir en un projet web conforme. Je porte une attention particulière à l'expérience utilisateur et à l'optimisation (SEO & rapidité d'affichage) sur l'ensemble de mes projets.",
        "img": "faMagic"
      },
      {
        "id": 2,
        "title": "Ecommerce",
        "desc": "Création de plateforme de commerce électronique avec le CMS e-commerce Magento, qui est l'une des solutions open-source les plus complètes. Je me suis spécialisé dans les développements spécifiques pour adapter Magento à votre besoin et fonctionnement.",
        "img": "faShoppingBag"
      },
      {
        "id": 3,
        "title": "Application Web & mobile",
        "desc": "Création d'applications métier, d'Intranet, d'Extranet, de sites Corporate et sites vitrines, de Web apps... Mises à jour régulières, correction de bogues, optimisation des performances et améliorations de la sécurité des applications et sites web.",
        "img": "faGears"
      },
      {
        "id": 4,
        "title": "Revue de code",
        "desc": "Analyser et vérifier que le code respect les bonnes pratiques, et veiller à sa qualité (lisibilité, clarté, consistance). Ainsi, le code devient plus maintenable, mieux architecturé et le nombre de bugs est réduit.",
        "img": "faCode"
      },
      {
        "id": 5,
        "title": "Optimisation",
        "desc": "Effectuer une analyse de performance et une optimisation de vos applications en entrant en détail dans le code source, dans les interactions entre les différentes briques et dans les bases de données afin de mener des actions efficaces pour améliorer les performances d'une application.",
        "img": "faRocket"
      },
      {
        "id": 6,
        "title": "SEO - Référencement naturel",
        "desc": "Optimisation pour les moteurs de recherche en appliquant un ensemble de techniques, de règles et bonnes pratiques pour améliorer la visibilité des sites web et leurs positions dans les résultats des moteurs de recherche",
        "img": "faBullhorn"
      }
    ]
  },
  "contactSection": {
    "title": "Contact Moi",
    "location": "tunis , Tunisie",
    "email": "ach02raf@gmail.com",
    "phoneNumber": "+216 94622592"
  },
  "skillsSection": {
    "title": "Mes compétences",
    "listeSkills": [
      {
        "id": 0,
        "title": "Langages de programmation",
        "listeLangage": [
          "C",
          "C-SHARP",
          "JAVA",
          "JAVASCRIPT",
          "TYPESCRIPT",
          "PYTHON",
          "PHP"
        ]
      },
      {
        "id": 1,
        "title": "Langages de balisage",
        "listeLangage": ["HTML", "XML"]
      },
      {
        "id": 2,
        "title": "Langages de styles",
        "listeLangage": ["CSS", "SCSS", "SASS"]
      },
      {
        "id": 3,
        "title": "Framework",
        "listeLangage": [
          "EXPRESS.JS",
          "NEXT.JS",
          "SPRINGBOOT",
          "DJANGO",
          "ANGULAR",
          "REACT NATIVE",
          "SWIFT UI",
          "IONIC",
          ".NET CORE",
          "BOOTSTRAP 5",
          "TAILWIND CSS"
        ]
      },
      {
        "id": 4,
        "title": "Bibliothèque JS/TS",
        "listeLangage": ["REACT"]
      },
      {
        "id": 5,
        "title": "DevOps",
        "listeLangage": ["GIT", "GITHUB", "JENKINS", "HOSTINGER", "AWS"]
      },
      {
        "id": 6,
        "title": "CMS",
        "listeLangage": ["WORDPRESS"]
      },
      {
        "id": 7,
        "title": "Autres",
        "listeLangage": ["REST", "RESTFUL", "GRAPHQL", "SOAP"]
      }
    ]
  },
  "Footer": { "title": "@ 2023 TOUS DROITS RÉSERVÉS PAR ACH02RAF" }
}
